# ModelPath Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelPath Properties
ModelPath Class See Also
---
The ModelPath type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CentralServerPath | The path to the location of the central Revit server or cloud. |
| CloudPath | Whether this path represents a path on an Autodesk server such as BIM360. |
| Empty | Whether this path is empty |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Region | The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model. |
| ServerPath | Whether this path is a server path (as opposed to a file path or cloud path) |

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace